Revit 2027 API
FabricationPart.HasInsulation Property
 True if the fabrication part is insulated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasInsulation { get; }
Public ReadOnly Property HasInsulation As Boolean
	Get
public:
property bool HasInsulation {
	bool get ();
}
member HasInsulation : bool with get
Property Value
Boolean
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace